Revit 2027 API
BuiltInFailures.StructuralLoadFailures.CannotMoveBoundaryCondition Property
 Can't move Boundary Conditions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveBoundaryCondition { get; }
Public Shared ReadOnly Property CannotMoveBoundaryCondition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveBoundaryCondition {
	FailureDefinitionId^ get ();
}
static member CannotMoveBoundaryCondition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace